In [75]:
import pandas as pd
df = pd.read_csv('data/score.csv', index_col='지원번호')
df_score= df.loc[:, '국어':'사회']
df_score.to_csv('data/학생성적.csv')

In [76]:
df = pd.read_csv('data/학생성적.csv')
df['지원번호']=df['지원번호'].str.replace('번', '')
df['지원번호']=df['지원번호'].apply(lambda x:int(x))

In [77]:
df.to_csv('data/학생성적.csv', index=False)

In [78]:
score = pd.read_csv('data/학생성적.csv')
cols=list(score.columns)
cols

['지원번호', '국어', '영어', '수학', '과학', '사회']

In [79]:
for idx in range(len(score)):
    row = score.loc[idx]
    for col in cols:
        print(f'{col}:{row[col]}', end=' ')
    print()

지원번호:1 국어:90 영어:85 수학:100 과학:95 사회:85
지원번호:2 국어:40 영어:35 수학:50 과학:55 사회:25
지원번호:3 국어:80 영어:75 수학:70 과학:80 사회:75
지원번호:4 국어:40 영어:60 수학:70 과학:75 사회:80
지원번호:5 국어:15 영어:20 수학:10 과학:35 사회:10
지원번호:6 국어:80 영어:100 수학:95 과학:85 사회:80
지원번호:7 국어:55 영어:65 수학:45 과학:40 사회:35
지원번호:8 국어:100 영어:85 수학:90 과학:95 사회:95

In [80]:
score

   지원번호   국어   영어   수학  과학  사회
0     1   90   85  100  95  85
1     2   40   35   50  55  25
2     3   80   75   70  80  75
3     4   40   60   70  75  80
4     5   15   20   10  35  10
5     6   80  100   95  85  80
6     7   55   65   45  40  35
7     8  100   85   90  95  95

In [81]:
#index=list(score.index)
index=max(score.index)+1
index

TypeError: 'str' object is not callable

In [ ]:
no = score['지원번호'].max()
no = no+1
no

np.int64(9)

In [ ]:
score.loc[index]=[no, 0,0,0,0,0]

In [ ]:
score=pd.read_csv('data/학생성적.csv')
score

   지원번호   국어   영어   수학  과학  사회
0     1   90   85  100  95  85
1     2   40   35   50  55  25
2     3   80   75   70  80  75
3     4   40   60   70  75  80
4     5   15   20   10  35  10
5     6   80  100   95  85  80
6     7   55   65   45  40  35
7     8  100   85   90  95  95

In [ ]:
no=input('지원번호>')
filt = score['지원번호']==int(no)
idxs = score[filt].index
if len(idxs)==0:
    print('검색데이터가 없습니다.')
else:
    row = score.loc[idxs[0]]
    for col in cols:
        print(f'{col}:{row[col]}')

검색데이터가 없습니다.

In [ ]:
score.loc[0]

지원번호      1
국어       90
영어       85
수학      100
과학       95
사회       85
Name: 0, dtype: int64

In [ ]:
score

   지원번호   국어   영어   수학  과학  사회
0     1   90   85  100  95  85
1     2   40   35   50  55  25
2     3   80   75   70  80  75
3     4   40   60   70  75  80
4     5   15   20   10  35  10
5     6   80  100   95  85  80
6     7   55   65   45  40  35
7     8  100   85   90  95  95

In [ ]:
no=8
filt = score['지원번호'] == no
idx=score[filt].index
if len(idx)==0:
    print('No Date')
else:
    row = score.loc[idx[0]]
    for col in cols:
        print(f'{col}:{row[col]}', end=' ')
    score.drop(index=idx[0], inplace=True)

지원번호:8 국어:100 영어:85 수학:90 과학:95 사회:95

In [ ]:
score=pd.read_csv('data/학생성적.csv')
score=score.sort_values('국어', ascending=False)
score

   지원번호   국어   영어   수학  과학  사회
7     8  100   85   90  95  95
0     1   90   85  100  95  85
5     6   80  100   95  85  80
2     3   80   75   70  80  75
6     7   55   65   45  40  35
1     2   40   35   50  55  25
3     4   40   60   70  75  80
4     5   15   20   10  35  10

In [ ]:
for idx in score.index:
    row = score.loc[idx]
    print(row['지원번호'])

8
1
6
3
7
2
4
5

In [82]:
import pandas as pd
score = pd.read_csv('data/학생정보.csv')
score.set_index('지원번호', inplace=True)
score

       이름   학교  학년    키        SW특기
지원번호
1번    채치수  북산고   3  197      Python
2번    정대만  북산고   3  184        Java
3번    송태섭  북산고   3  168  Javascript
4번    서태웅  북산고   1  187         NaN
5번    강백호  북산고   1  188         NaN
6번    변덕규  능남고   3  202           C
7번    황태산  능남고   2  188      Python
8번    윤대협  능남고   2  190          C#

In [83]:
score

       이름   학교  학년    키        SW특기
지원번호
1번    채치수  북산고   3  197      Python
2번    정대만  북산고   3  184        Java
3번    송태섭  북산고   3  168  Javascript
4번    서태웅  북산고   1  187         NaN
5번    강백호  북산고   1  188         NaN
6번    변덕규  능남고   3  202           C
7번    황태산  능남고   2  188      Python
8번    윤대협  능남고   2  190          C#

In [ ]:
score.loc['10번','이름'] = '홍길동'

In [ ]:
score

       이름   학교   학년      키        SW특기
지원번호
1번    채치수  북산고  3.0  197.0      Python
2번    정대만  북산고  3.0  184.0        Java
3번    송태섭  북산고  3.0  168.0  Javascript
4번    서태웅  북산고  1.0  187.0         NaN
5번    강백호  북산고  1.0  188.0         NaN
6번    변덕규  능남고  3.0  202.0           C
7번    황태산  능남고  2.0  188.0      Python
8번    윤대협  능남고  2.0  190.0          C#
10번   홍길동  NaN  NaN    NaN         NaN

In [84]:
score.reset_index(inplace=True)
score

  지원번호   이름   학교  학년    키        SW특기
0   1번  채치수  북산고   3  197      Python
1   2번  정대만  북산고   3  184        Java
2   3번  송태섭  북산고   3  168  Javascript
3   4번  서태웅  북산고   1  187         NaN
4   5번  강백호  북산고   1  188         NaN
5   6번  변덕규  능남고   3  202           C
6   7번  황태산  능남고   2  188      Python
7   8번  윤대협  능남고   2  190          C#

In [85]:
def change(no):
    no = no.replace('번', '')
    no = int(no)
    no = f'{no:02d}'
    return no

In [86]:
score['지원번호'] = score['지원번호'].apply(change)
score.set_index('지원번호', inplace=True)
score

       이름   학교  학년    키        SW특기
지원번호
01    채치수  북산고   3  197      Python
02    정대만  북산고   3  184        Java
03    송태섭  북산고   3  168  Javascript
04    서태웅  북산고   1  187         NaN
05    강백호  북산고   1  188         NaN
06    변덕규  능남고   3  202           C
07    황태산  능남고   2  188      Python
08    윤대협  능남고   2  190          C#

In [96]:
idxs = score.index
idxs = idx.astype(int)
max = idxs.max()
idx = f'{max+1:02d}'
idx

'09'